app/View/Components/NewsWidget.php

select * from `employees` where `employees`.`id` in (1, 2, 4, 5)
select * from `posts` where `status` = 1 order by `created_at` desc limit 10
select * from `users` where `users`.`employee_id` in (1, 2, 4, 5)
---
    public function __construct()
    {
        // Berita Terbaru Aktif
        $this->newPosts = Post::with('employee.user')->where('status', true)
            ->latest()
            ->take(10)
            ->get();