app/Http/Controllers/CheckStatusController.php

    public function __invoke(Request $request)
    {
        // Validasi Search Form
        $validated = $request->validate([
            'search' => 'nullable|string|max:255',
        ]);

        // Status Laporan
        $search = $validated['search'] ?? null;

        // Status Laporan
        $report = Report::with('statuses')->where('ticket_number', 'LIKE', "$search")->first();
---
select * from `reports` where `ticket_number` LIKE '850471146212' limit 1
select * from `statuses` where `statuses`.`report_id` in (6)