app/Http/Controllers/HomeController.php

    public function __invoke()
    {
        $title = "Beranda";

        $post = Post::with('employee.user')->where('status', true)
            ->latest()
            ->first();

        $newPosts = Post::with('employee.user')->where('status', true)
            ->latest()
            ->take(5)
            ->get();
---
select * from `employees` where `employees`.`id` in (2)
select * from `posts` where `status` = 1 order by `created_at` desc limit 1
select * from `users` where `users`.`employee_id` in (2)
select * from `employees` where `employees`.`id` in (1, 2, 4, 5)
select * from `posts` where `status` = 1 order by `created_at` desc limit 5
select * from `users` where `users`.`employee_id` in (1, 2, 4, 5)