app/Http/Controllers/PostController.php

select * from `employees` where `employees`.`id` in (1, 2, 4, 5)
select * from `posts` where `status` = 1 order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`employee_id` in (1, 2, 4, 5)
select count(*) as aggregate from `posts` where `status` = 1
select * from `posts` where `status` = 1 order by `views` desc limit 9
---
    public function index()
    {
        $title = "Berita";

        // Semua Berita Aktif
        $posts = Post::with('employee.user')->where('status', true)
            ->orderBy('created_at', 'DESC')
            ->paginate(10);

        // Berita Aktif Populer
        $popularPosts = Post::with('employee.user')->where('status', true)
            ->orderBy('views', 'DESC')
            ->take(9)
            ->get();

select * from `employees` where `employees`.`id` in (4)
select * from `posts` where `status` = 1 and `slug` = 'vel-ex-adipisci-in-velit-earum-blanditiis-nulla' limit 1
select * from `users` where `users`.`employee_id` in (4)
---
    public function show(string $slug)
    {
        $title = "Berita " . $slug;

        // Lihat Berita Aktif
        $post = Post::with('employee.user')->where('status', true)
            ->where('slug', $slug)
            ->firstOrFail();