app/Http/Controllers/Dashboard/EmployeeController.php

select * from `employees` order by `name` asc limit 10 offset 0
select * from `reports` where `reports`.`employee_id` in (1, 2, 3, 4, 5)
select * from `users` where `users`.`employee_id` in (1, 2, 3, 4, 5)
select count(*) as aggregate from `employees`
---
    public function index(Request $request)
    {
        $title = "Karyawan";

        // Validasi Search Form
        $validated = $request->validate([
            'search' => 'nullable|string|max:50',
            'status' => 'nullable|string|max:50',
        ]);

        $search = $validated['search'] ?? null;
        $status = $validated['status'] ?? null;

        // Semua Karyawan Dengan Data Berita dan Laporan
        $employees = Employee::with(['user', 'posts', 'reports'])
            ->when($search, function ($query, $search) {
                return $query->where('name', 'like', '%' . $search . '%');
            })
            ->when($status, function ($query, $status) {
                if ($status == 'active') {
                    return $query->where('status', true);
                } elseif ($status == 'inactive') {
                    return $query->where('status', false);
                }
            })
            ->orderBy('name', 'ASC')
            ->paginate(10);

select * from `employees` where `nip` = '904156094289258540' limit 1
select * from `users` where `users`.`employee_id` in (1)
---
    public function show(string $nip)
    {
        $title = "Karyawan " . $nip;

        // Ambil Data Karyawan Berdasarkan NIP
        $employee = Employee::with(['user', 'posts', 'reports'])->where('nip', $nip)->firstOrFail();