app/Http/Controllers/Dashboard/PostController.php

select * from `employees` where `employees`.`id` in (1, 2, 4, 5)
select * from `posts` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`employee_id` in (1, 2, 4, 5)
select count(*) as aggregate from `posts` where `status` = '0'
---
    public function index(Request $request)
    {
        $title = "Berita";

        // Validasi Search Form
        $validated = $request->validate([
            'search' => 'nullable|string|max:50',
            'status' => 'nullable|string|max:50',
        ]);

        $search = $validated['search'] ?? null;
        $status = $validated['status'] ?? null;

        // Semua Berita Aktif
        $posts = Post::with('employee.user')
            ->when($search, function ($query, $search) {
                return $query->where('title', 'LIKE', "%{$search}%")
                    ->orWhereHas('employee.user', function ($query) use ($search) {
                        $query->where('name', 'LIKE', "{$search}%");
                    });
            })
            ->when($status !== null, function ($query) use ($status) {
                return $query->where('status', $status);
            })
            ->orderBy('created_at', 'DESC')
            ->paginate(10);

select * from `posts` where `slug` = 'berita-pertama' limit 1
---
    public function show(string $slug)
    {
        $title = "Berita " . $slug;

        // Ambil Data Berdasarkan Slug
        $post = Post::where('slug', $slug)->firstOrFail();

select * from `posts` where `slug` = 'berita-pertama' limit 1
---
    public function edit(string $slug)
    {
        $title = "Ubah Berita " . $slug;

        // Ambil Data Berdasarkan Slug
        $post = Post::where('slug', $slug)->firstOrFail();