app/Http/Controllers/Dashboard/ReportController.php

    public function index(Request $request)
    {
        $title = "Laporan";

        // Validasi Search Form
        $validated = $request->validate([
            'receivedSearch' => 'nullable|string|max:50',
            'search' => 'nullable|string|max:50',
            'status' => 'nullable|string|max:50',
        ]);

        $receivedSearch = $validated['receivedSearch'] ?? null;
        $search = $validated['search'] ?? null;
        $status = $validated['status'] ?? null;

        // Semua Laporan Diterima
        $receivedReports = Report::with(['employee.user', 'latestStatus'])
            ->whereHas('latestStatus', function ($query) {
                $query->where('status', 'Diterima');
            })
            ->when($receivedSearch, function ($query, $receivedSearch) {
                return $query->where(function ($query) use ($receivedSearch) {
                    $query->where('ticket_number', 'LIKE', "%{$receivedSearch}%")
                        ->orWhere('violence_category', 'LIKE', "%{$receivedSearch}%")
                        ->orWhereHas('employee.user', function ($query) use ($receivedSearch) {
                            $query->where('name', 'LIKE', "%{$receivedSearch}%");
                        });
                });
            })
            ->orderBy('created_at', 'DESC')
            ->paginate(5);

        // Semua Laporan
        $reports = Report::with(['employee.user', 'latestStatus'])
            ->when($status, function ($query) use ($status) {
                return $query->whereHas('latestStatus', function ($query) use ($status) {
                    $query->where('status', $status);
                });
            })
            ->when($search, function ($query, $search) {
                return $query->where(function ($query) use ($search) {
                    $query->where('ticket_number', 'LIKE', "%{$search}%")
                        ->orWhere('violence_category', 'LIKE', "%{$search}%")
                        ->orWhereHas('employee.user', function ($query) use ($search) {
                            $query->where('name', 'LIKE', "%{$search}%");
                        });
                });
            })
            ->orderBy('created_at', 'DESC')
            ->paginate(10);
---
select * from `employees` where `employees`.`id` in (1, 2, 3)
select * from `users` where `users`.`employee_id` in (1, 2, 3)
select * from `reports` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `reports`

    public function store(Request $request, string $ticket_number)
    {
        // Validasi Input
        $validatedData = $request->validate([
            'status' => 'required|string|max:255',
            'description' => 'required|string|max:1000',
        ]);

        // Ambil Data Berdasarkan Nomor Tiket
        $report = Report::with(['statuses', 'victim', 'perpetrator', 'reporter'])->where('ticket_number', $ticket_number)->firstOrFail();

        // Isi Data Ditangani Oleh
        if (!$report->employee_id) {
            $user = Auth::user();

            if ($user && $user->employee_id) {
                $report->employee_id = $user->employee_id;
                $report->save();
            }
        }

        // Isi Data Status
        $report->statuses()->create([
            'report_id' => $report->id,
            'status' => $validatedData['status'],
            'description' => $validatedData['description'],
        ]);

        return redirect()->route('dashboard.reports.show', $report->ticket_number)
            ->with('success', 'Status berhasil ditambahkan.');
---
select * from `reports` where `ticket_number` = '850471146212' limit 1
select * from `statuses` where `statuses`.`report_id` in (6)

    public function show(string $ticket_number)
    {
        $title = "Laporan " . $ticket_number;

        // Ambil Data Berdasarkan Nomor Tiket Serta Statusnya
        $report = Report::with(['statuses', 'victim', 'perpetrator', 'reporter'])->where('ticket_number', $ticket_number)->firstOrFail();
---
select * from `perpetrators` where `perpetrators`.`report_id` in (6)
select * from `reporters` where `reporters`.`report_id` in (6)
select * from `victims` where `victims`.`report_id` in (6)